{
  "videoId": "BZ6JNF7HZe4",
  "subtitles": [
    {
      "startTimeString": "00:00:01,440",
      "endTimeString": "00:00:06,680",
      "text": "Hi everyone and welcome to the Mia-Platform tutorials. Today we're going to take a look"
    },
    {
      "startTimeString": "00:00:06,681",
      "endTimeString": "00:00:12,760",
      "text": "at the Mia-Assistant, which is the AI chatbot in the Mia-Platform Console. Imagine that"
    },
    {
      "startTimeString": "00:00:12,761",
      "endTimeString": "00:00:23,480",
      "text": "you are a new developer on the Mia-Platform Console and you want to orchestrate a saga, but you don't know what to do. This is where the Mia-Assistant comes in handy! It facilitates the"
    },
    {
      "startTimeString": "00:00:23,481",
      "endTimeString": "00:00:34,000",
      "text": "understanding of the console features and exploration of the product; it also speeds up your search in docs and suggests things that can be done on the Mia-Platform console. It also"
    },
    {
      "startTimeString": "00:00:34,001",
      "endTimeString": "00:00:39,720",
      "text": "simplifies your access to Features. So let's begin: go ahead here on the lefthand side and"
    },
    {
      "startTimeString": "00:00:39,721",
      "endTimeString": "00:00:44,720",
      "text": "click on Mia-Assistant. This is going to open the chatbot that will help answer all of your"
    },
    {
      "startTimeString": "00:00:44,721",
      "endTimeString": "00:00:52,040",
      "text": "questions. Let's give it a few commands to test it out. Let's start with: \"Can I orchestrate a"
    },
    {
      "startTimeString": "00:00:52,041",
      "endTimeString": "00:01:00,280",
      "text": "saga?\". As you can see here it will return all of the options for you to orchestrate a saga and will"
    },
    {
      "startTimeString": "00:01:00,281",
      "endTimeString": "00:01:05,560",
      "text": "also link different documents that you can use to learn more about this. For the second command,"
    },
    {
      "startTimeString": "00:01:05,561",
      "endTimeString": "00:01:14,640",
      "text": "let's go ahead and give: \"Can you make an example of an orchestrated saga?\"."
    },
    {
      "startTimeString": "00:01:14,641",
      "endTimeString": "00:01:26,440",
      "text": "As you can see here the Mia-Assistant is going to give you an actual real life example that you can use to create an orchestrated Saga. Perfect. Now,"
    },
    {
      "startTimeString": "00:01:26,441",
      "endTimeString": "00:01:54,280",
      "text": "if you want to further understand this you can also ask:\"What if it was a saga of a loyalty program?\". As you can see here it will give you an in-depth answer about the"
    },
    {
      "startTimeString": "00:01:54,281",
      "endTimeString": "00:02:03,880",
      "text": "Saga of a loyalty program. You can also ask: \"How can I install the Flow Manager using the"
    },
    {
      "startTimeString": "00:02:03,881",
      "endTimeString": "00:02:17,320",
      "text": "Console?\". Here it will give you the exact code that you need to install the Flow Manager using"
    },
    {
      "startTimeString": "00:02:17,321",
      "endTimeString": "00:02:26,520",
      "text": "the Console. Perfect, let's go ahead and thank the Mia-Assistant for helping us with this task,"
    },
    {
      "startTimeString": "00:02:26,521",
      "endTimeString": "00:02:30,160",
      "text": "and thank you guys for watching. As always if you have any questions"
    },
    {
      "startTimeString": "00:02:30,161",
      "endTimeString": "00:02:40,640",
      "text": "feel free to reach out to us via email, on our website or book a demo with us! Thank you."
    }
  ]
}
