[
  {
    "title": "Console",
    "icon": "console",
    "defaultOpen": true,
    "type": "versions",
    "items": {
      "newFeatures": [
        {
          "title": "Introduced Chat History for Mia-Assistant",
          "description": [
            "Users can now access past conversations with the Mia-Assistant through a chat history view, which displays a list of previous chats with automatically generated titles and allows them to be reopened directly from the chat interface."
          ]
        },
        {
          "title": "Remote access to the Mia-Platform Console MCP Server",
          "description": [
            "The Mia-Platform Console MCP Server is now accessible remotely, and external AI clients (like Visual Studio Code) can connect to it using the available server endpoint to their configuration.",
            "This feature improves flexibility by allowing users to communicate and perform operations on their projects using an MCP Server always running and always updated with the latest tools and prompts from the Mia-Platform Console.",
            "The feature is available **only in Mia-Platform PaaS**. For more information on how to use it, please read the [related documentation page](/docs/products/console/mcp/mcp-server/setup)."
          ]
        }
      ],
      "improvements": [
        {
          "title": "UX/UI Improvements of Projects List",
          "description": [
            "The Projects list now includes the project creation date, supports sorting by name and creation date, and firstly displays the Favorites tab by default."
          ]
        }
      ],
      "bugFixes": [
        "We resolved an issue where clicking on the Mia-Platform Console logo caused an infinite loading state instead of redirecting the user to the list of their companies."
      ]
    }
  },
    {
    "title": "Microfrontend Composer",
    "icon": "microfrontend-composer",
    "defaultOpen": false,
    "type": "versions",
    "items": {
      "newFeatures": [],
      "improvements": [
        {
          "title": "Back-kit",
          "description": [
            "The new version `v1.5.21` of the back-kit library is available!",
            "Refer to back-kit [changelog](/docs/products/microfrontend-composer/back-kit/changelog) for finer-grained details of new versions."
          ]
        }
      ],
      "bugFixes": [
        "Fixed table loops when switching from data tab to empty tab"
      ]
    }
  }
]
